src/cf/DataProcessors/ЗагрузкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалют</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НазваниеВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦифровойКодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СимвольныйКодВалюты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаКурсовВалют/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПолучитьВалюты(Команда)
	Если НЕ ЗначениеЗаполнено(ДатаЗагрузки) Тогда
		Сообщить("Не выбрана дата загрузки!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;   
	ТаблицаКурсовВалют.Очистить();
	ЗагрузитьКурсыВалют(ДатаЗагрузки);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалют(ДатаЗагрузки)	
	Прокси = WSСсылки.КурсыВалютССайтаЦБ.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date = ДатаЗагрузки;
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	Для каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
		НоваяСтрокаТЗ = ТаблицаКурсовВалют.Добавить(); // Добавление в табличную часть данных.
		НоваяСтрокаТЗ.НазваниеВалюты = Элемент.Vname; // Добавление в столбец "НазваниеВалюты" элемента с сайта Vname 		
		НоваяСтрокаТЗ.Номинал = Элемент.Vnom; 
		НоваяСтрокаТЗ.ЦифровойКодВалюты = Элемент.Vcode;		
		НоваяСтрокаТЗ.СимвольныйКодВалюты = Элемент.VChCode;		
		НоваяСтрокаТЗ.КурсВалюты = Элемент.Vcurs;   
		
		РегКурсыВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		РегКурсыВалют.Период = ДатаЗагрузки;
		РегКурсыВалют.НазваниеВалюты = Элемент.Vname;
		РегКурсыВалют.Номинал = Элемент.Vnom;
		РегКурсыВалют.ЦифровойКодВалюты = Элемент.Vcode;
		РегКурсыВалют.СимвольныйКодВалюты = Элемент.VChCode;
		РегКурсыВалют.КурсВалюты = Элемент.Vcurs;
		РегКурсыВалют.Записать(Истина);
	КонецЦикла; 
	
КонецПроцедуры
